//Name: Multiple failed login attempts
//Description: This detection identifies users that failed multiple login attempts in a single session with respect to the baseline learned, which could indicate on a breach attempt.

SigninLogs 
| where UserPrincipalName == ''
| where TimeGenerated  > todatetime('2021-12-06,00:00:00')
| project UserDisplayName, UserPrincipalName, OperationName, AuthenticationRequirement, AppDisplayName, Status,  IPAddress, Location, DeviceDetail, AuthenticationDetails, ConditionalAccessStatus, ClientAppUsed, UserAgent
