//Name: Multiple failed user logon attempts to a service
//Description: Activity policy ''Multiple failed user logon attempts to a service'' was triggered

SigninLogs 
| where UserPrincipalName == ''
| where TimeGenerated  > todatetime('2021-12-06,00:00:00')
| project UserDisplayName, UserPrincipalName, OperationName, AuthenticationRequirement, AppDisplayName, Status,  IPAddress, Location, DeviceDetail, AuthenticationDetails, ConditionalAccessStatus, ClientAppUsed, UserAgent
